Revit 2024 API
EnergyAnalysisDetailModel.Parameter Property
Retrieves a parameter from the element given an identifier.
Overload List
Name | Description
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
See Also
EnergyAnalysisDetailModel Class
EnergyAnalysisDetailModel Members
Autodesk.Revit.DB.Analysis Namespace